"""
# k=1
1
1개
# k=2
1 1
2
2개
# k=3
1 1 1
1 2
2 1
3
4개
# k=4
1 1 1 1
1 1 2
1 2 1
2 1 1
2 2
1 3
3 1
7개
# k=5
1 1 1 1 1
1 1 1 2
1 1 2 1
1 2 1 1
1 2 2
1 3 1
1 1 3
2 1 1 1
2 1 2
2 2 1
2 3
3 1 1
3 2
13개
# k=6
1 1 1 1 1 1
1 1 1 1 2
1 1 1 2 1
1 1 2 1 1
1 2 1 1 1
1 1 2 2
1 2 1 2
1 2 2 1
1 1 1 3
1 1 3 1
1 3 1 1
1 2 3
1 3 2
2 1 1 1 1
2 1 1 2
2 1 2 1
2 2 1 1
2 2 2
2 1 3
2 3 1
3 1 1 1
3 1 2
3 2 1
3 3
24개

k=1 일때 1
k=2 일때 2
k=3 일때 4
k=4 일때 1, 2, 3 경우의 수 합 7(1 2 4)
k=5 일때 2, 3, 4 경우의 수 합 13(2 4 7)
k=6 일때 3, 4, 5 경우의 수 합 24(4 7 13)
k=7 일때 4, 5, 6 경우의 수 합 44(7 13 24)
k>3 일때 (k-1) (k-2) (k-3)

"""

import sys

input = sys.stdin.readline

k = int(input())


def sumNum(k):
    if k == 1:
        return 1
    elif k == 2:
        return 2
    elif k == 3:
        return 4
    else:
        return sumNum(k - 1) + sumNum(k - 2) + sumNum(k - 3)


for i in range(k):
    n = int(input())
    print(sumNum(n))
